
## Terraform plan for environment: `prep`

**Commit:** 197e2b01e52a51ccabadef5532fff12bfa438534


**API version:** release-v5.11.0
**CLI version:** release-v5.11.0
**Selfserve version:** release-v5.11.0
**Internal version:** release-v5.11.0

### Plan summary

`17 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_compute_environment.this["fargate"]
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_iam_policy_attachment.additional_inline[0]
module.service.module.eventbridge.aws_iam_role.eventbridge[0]
```
**📖 Reads**

```tf
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_compute_environment.this["fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "vol-app-prep-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::146997448015:role/vol-app-prep-batch-service-20241129153434254400000002"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 16
          + security_group_ids = [
              + "sg-c54f0fa1",
            ]
          + type               = "FARGATE"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["default"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "vol-app-prep-default"
      + priority              = 1
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:146997448015:scheduling-policy/vol-app-prep-default"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "vol-app-prep-default"
        }
      + tags_all              = {
          + "Environment" = "prep"
          + "JobQueue"    = "vol-app-prep-default"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-api-cluster/vol-app-prep-api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-api-cluster/vol-app-prep-api-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["api"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-prep-api-cluster/vol-app-prep-api-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + suspended_state (known after apply)
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:146997448015:cluster/vol-app-prep-api-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-prep-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = "vol-app-prep-api-service:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-c54f0fa1",
            ]
          + subnets          = [
              + "subnet-0054beb4dbbefae8e",
              + "subnet-0939547ad77cce166",
              + "subnet-09eae6389bb8c1459",
            ]
        }

      + timeouts {}
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-internal-cluster/vol-app-prep-internal-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-internal-cluster/vol-app-prep-internal-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["internal"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-prep-internal-cluster/vol-app-prep-internal-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + suspended_state (known after apply)
    }

  # module.service.module.ecs_service["internal"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:146997448015:cluster/vol-app-prep-internal-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-prep-internal-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = "vol-app-prep-internal-service:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-f1581895",
            ]
          + subnets          = [
              + "subnet-008af366f6a1c4455",
              + "subnet-0b2ff3f9f104e7205",
              + "subnet-0c44c1f80488dd334",
            ]
        }

      + timeouts {}
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-selfserve-cluster/vol-app-prep-selfserve-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/vol-app-prep-selfserve-cluster/vol-app-prep-selfserve-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.service.module.ecs_service["selfserve"].aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "service/vol-app-prep-selfserve-cluster/vol-app-prep-selfserve-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + suspended_state (known after apply)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:146997448015:cluster/vol-app-prep-selfserve-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "vol-app-prep-selfserve-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + task_definition                    = "vol-app-prep-selfserve-service:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-316e2e55",
            ]
          + subnets          = [
              + "subnet-03126dce69e068b76",
              + "subnet-09d4b4600dcc7df2c",
              + "subnet-0a6adfbba83aa109a",
            ]
        }

      + timeouts {}
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-ntu:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-community-licences:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-generation:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-disc-print:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-ecmt-accept:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-general:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-irhp-allocate:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-generation:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-permit-print:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-queue-print:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-psv-operator-list-export:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-remove-read-audit:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-resolve-payments:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-system-parameter:1",
              + "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-transxchange-consumer:1",
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "vol-app-prep-batch-scheduler-inline"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "vol-app-prep-batch-scheduler-inline"
        }
      + tags_all         = {
          + "Environment" = "prep"
          + "Name"        = "vol-app-prep-batch-scheduler-inline"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + name       = "vol-app-prep-batch-scheduler"
      + policy_arn = (known after apply)
      + roles      = [
          + "vol-app-prep-batch-scheduler",
        ]
    }

  # module.service.module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vol-app-prep-batch-scheduler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "vol-app-prep-batch-scheduler"
        }
      + tags_all              = {
          + "Environment" = "prep"
          + "Name"        = "vol-app-prep-batch-scheduler"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

</details>